foam-volume/OpenFOAM/openfoam-v2506/run/h42_scratchles/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "6000";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
72100
(
(0.48361018 -3.6378882e-05 0.0)
(0.48775852 -9.673286e-06 0.0)
(0.48430392 2.1716221e-05 0.0)
(0.45929247 2.3604409e-05 0.0)
(0.45389977 2.3159668e-05 0.0)
(0.44888762 2.222024e-05 0.0)
(0.44406217 2.1514508e-05 0.0)
(0.4393808 2.1251313e-05 0.0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           nonuniform List<vector> 
175
(
(0.40343 2.91841e-07 0)
(1.21953 2.37138e-06 0)
(2.05236 6.63706e-06 0)
(2.88965 1.33651e-05 0)
(3.69542 2.24287e-05 0)
(4.4248 3.33883e-05 0)
(5.05294 4.57625e-05 0)
(5.58419 5.9234e-05 0)
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    bottom
    {
        type            noSlip;
    }
    top
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
