foam-volume/OpenFOAM/openfoam-v2506/run/h42_scratchles/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   uniform 0.266974;

boundaryField
{
    bottom
    {
		type            epsilonWallFunction;
        value           $internalField;
		lowReCorrection	true;
    }
    top
    {
		type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
		value			uniform 0.266974;
    }
    outlet
    {
        type            zeroGradient;
    }
    "(front|back)"
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
