foam-volume/OpenFOAM/openfoam-v2506/run/h42_scratchles/0/grad(U)
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volTensorField;
    location    "0";
    object      grad(U);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<tensor> 
72100
(
(27.2306 -0.00769838 0 20299.3 -3.24798 0 0 0 0)
(0.110067 0.0097071 0 19648.6 -0.933795 0 0 0 0)
(-4.81493 0.00558664 0 19525.1 1.91113 0 0 0 0)
(-5.15683 0.000243732 0 19106.7 2.2789 0 0 0 0)
(-1.78595 -0.000238015 0 18890.5 2.22821 0 0 0 0)
(-1.70423 -0.000284841 0 18691.3 2.13904 0 0 0 0)
(-1.66209 -0.000169057 0 18499 2.0791 0 0 0 0)
(-1.63263 -6.2674e-05 0 18312.4 2.04931 0 0 0 0)
...
)
;

boundaryField
{
    inlet
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
175
(
(53.0817 -0.0242771 0 20299.3 -3.24798 0 0 0 0)
(170.676 -0.185897 0 17825.9 -5.30783 0 0 0 0)
(121.113 -0.374691 0 17337.1 -7.13848 0 0 0 0)
(225.582 -0.671564 0 18653.9 -8.77664 0 0 0 0)
(311.25 -0.98684 0 14878.6 -7.62635 0 0 0 0)
(252.479 -1.21975 0 12849.4 -6.89264 0 0 0 0)
(339.613 -1.49964 0 12658.3 -6.63438 0 0 0 0)
(419.612 -1.72653 0 9427.22 -4.4576 0 0 0 0)
...
)
;
    }
    outlet
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
175
(
(0 0 0 20683.1 -18.4741 0 0 0 0)
(0 0 0 19901.9 -39.6419 0 0 0 0)
(0 0 0 18539.2 -57.1013 0 0 0 0)
(0 0 0 16585 -68.0154 0 0 0 0)
(0 0 0 14277.9 -71.9482 0 0 0 0)
(0 0 0 11971.7 -72.0562 0 0 0 0)
(0 0 0 9872.8 -70.7334 0 0 0 0)
(0 0 0 8100.35 -67.5323 0 0 0 0)
...
)
;
    }
    bottom
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
412
(
(27.2306 -0.00769838 0 20153.5 -1.51602 0 0 0 0)
(0.110067 0.0097071 0 20326.4 -0.403115 0 0 0 0)
(-4.81493 0.00558664 0 20182.4 0.904981 0 0 0 0)
(-5.15683 0.000243732 0 19140.1 0.983668 0 0 0 0)
(-1.78595 -0.000238015 0 18915.4 0.965134 0 0 0 0)
(-1.70423 -0.000284841 0 18706.5 0.925985 0 0 0 0)
(-1.66209 -0.000169057 0 18505.4 0.896575 0 0 0 0)
(-1.63263 -6.2674e-05 0 18310.3 0.885607 0 0 0 0)
...
)
;
    }
    top
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
412
(
(16.7469 -1.72252 0 0 0 0 0 0 0)
(0.832302 3.34844 0 0 0 0 0 0 0)
(1.47784 4.53695 0 0 0 0 0 0 0)
(1.95272 4.63522 0 0 0 0 0 0 0)
(2.42663 4.7394 0 0 0 0 0 0 0)
(2.91204 4.84859 0 0 0 0 0 0 0)
(3.41105 4.96309 0 0 0 0 0 0 0)
(3.9211 5.08334 0 0 0 0 0 0 0)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
