foam-volume/OpenFOAM/openfoam-v2506/run/h42_scratchles/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "6000";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
72100
(
0.035819225
0.032585826
0.031166183
0.03051806
0.030306682
0.030337924
0.030252578
0.030105654
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
175
(
0.00395803
0.00632693
0.0297326
0.0971268
0.220187
0.378777
0.53752
0.674905
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    bottom
    {
        type            kLowReWallFunction;
        value           nonuniform List<scalar> 
412
(
2.55012e-07
2.50362e-07
2.4412e-07
2.37603e-07
2.29892e-07
2.21654e-07
2.12935e-07
2.03879e-07
...
)
;
    }
    top
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
