foam-volume/OpenFOAM/openfoam-v2506/run/h42_scratchles/constant/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
72100
(
2.39963e-05
2.39963e-05
2.39963e-05
2.39963e-05
2.39963e-05
2.39963e-05
2.39963e-05
2.39963e-05
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
175
(
2.39963e-05
7.2601e-05
0.000122445
0.000173561
0.00022598
0.000279736
0.000334863
0.000391396
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
175
(
2.39963e-05
7.2601e-05
0.000122445
0.000173561
0.00022598
0.000279736
0.000334863
0.000391396
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
412
(
0
0
0
0
0
0
0
0
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
412
(
0.1525
0.1525
0.1525
0.1525
0.1525
0.1525
0.1525
0.1525
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
