foam-volume/OpenFOAM/openfoam-v2506/run/h42_scratchles/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            (sampling);

interpolationScheme cellPoint;

setFormat       csv;
surfaceFormat 	raw;

fields          (U k epsilon omega);

sets
(
    line1
    {
        type    uniform;
        axis    xyz;
        start   (2.95 0 0.025);
        end     (2.95 .1525 0.025);
        nPoints 10000;
    }


);

surfaces (
	bottomWall
    {
        type            patch;
        patches      (bottomWall);
    }
);



// ************************************************************************* //
